{"class_name": "Sequential", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [8, 8], "kernel_regularizer": null, "dtype": "float32", "dilation_rate": [1, 1], "batch_input_shape": [null, 128, 192, 3], "name": "conv2d_1", "filters": 96, "padding": "valid", "bias_regularizer": null, "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "name": "max_pooling2d_1"}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.2, "name": "dropout_1", "seed": null, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [5, 5], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_2", "filters": 128, "padding": "same", "bias_regularizer": null, "strides": [2, 2], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_3", "filters": 256, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_4", "filters": 256, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": null, "dilation_rate": [1, 1], "name": "conv2d_5", "filters": 128, "padding": "same", "bias_regularizer": null, "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "padding": "valid", "strides": [2, 2], "trainable": true, "pool_size": [3, 3], "name": "max_pooling2d_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"units": 512, "bias_regularizer": null, "name": "dense_1", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": {"class_name": "MaxNorm", "config": {"max_value": 3, "axis": 0}}, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "activation": "relu", "bias_constraint": null, "use_bias": true}}, {"class_name": "Dropout", "config": {"trainable": true, "rate": 0.5, "name": "dropout_2", "seed": null, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 2, "bias_regularizer": null, "name": "dense_2", "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "distribution": "uniform", "mode": "fan_avg", "scale": 1.0}}, "activity_regularizer": null, "activation": "softmax", "bias_constraint": null, "use_bias": true}}], "backend": "tensorflow", "keras_version": "2.1.5"}